documentation/docs/img/seed.dot
digraph G {
    google_service_account -> module.org_seed_project;
    google_service_account_key -> google_service_account.tf_seed_sa;
    tf_seed_sa_organization_iam_bindings -> google_service_account.tf_seed_sa;
    tf_seed_sa_project_iam_bindings -> google_service_account.tf_seed_sa;
    google_iam_workload_identity_pool -> module.module.org_seed_project;
    google_iam_workload_identity_pool_provider -> google_iam_workload_identity_pool.idp_pool;
    google_service_account_iam_binding -> google_iam_workload_identity_pool.idp_pool;
}
